In [2]:
import pandas as pd 
import numpy as np

In [3]:
my_list=[1,2,3,4]

In [4]:
a=pd.Series(my_list)

In [5]:
print(a)

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
my_characters=["a","b"]

In [7]:
b=pd.Series(my_characters)

In [8]:
print(b)

0    a
1    b
dtype: object

In [9]:
arr=np.array([10,20,30])

In [10]:
ay=pd.Series(arr)

print(ay)

In [11]:
numbers=[1,2]

In [12]:
num=pd.Series(numbers,index=my_characters)

In [13]:
print(num)

a    1
b    2
dtype: int64

In [14]:
data={
    "A":[1,2,3,4],
    "B":["a","b","c","d"],
    "C":[3,4,5,6]
}
d= pd.DataFrame(data)

In [15]:
print(d)

   A  B  C
0  1  a  3
1  2  b  4
2  3  c  5
3  4  d  6

In [16]:
db={
    "A":[1,2,3,4],
    "B":["a","b","c","d"],
    "C":[3,4,5,6]
}

df2= pd.DataFrame(db)
df2

   A  B  C
0  1  a  3
1  2  b  4
2  3  c  5
3  4  d  6

In [17]:
df2.iloc[:,0]

0    1
1    2
2    3
3    4
Name: A, dtype: int64

In [38]:
dd= pd.read_csv("data.csv")
dd

,student_id,name,age,gender,department,semester,marks,attendance_percentage
0,1,Ali,20,M,Computer Science,2,85,92
1,2,Ayesha,21,F,Computer Science,4,78,88
2,3,Ahmed,22,M,Software Engineering,6,90,95
3,4,Fatima,19,F,Information Technology,2,65,80
4,5,Hamza,23,M,Computer Science,8,72,85
5,6,Sara,21,F,Software Engineering,4,88,90
6,7,Usman,20,M,Information Technology,2,55,70
7,8,Hina,22,F,Computer Science,6,92,97
8,9,Bilal,24,M,Software Engineering,8,60,75
9,10,Zainab,19,F,Information Technology,1,83,89

In [39]:
dd["Index"]=["0","1","2","3","4","5","6","7","8","9"]
dd

,student_id,name,age,gender,department,semester,marks,attendance_percentage,Index
0,1,Ali,20,M,Computer Science,2,85,92,0
1,2,Ayesha,21,F,Computer Science,4,78,88,1
2,3,Ahmed,22,M,Software Engineering,6,90,95,2
3,4,Fatima,19,F,Information Technology,2,65,80,3
4,5,Hamza,23,M,Computer Science,8,72,85,4
5,6,Sara,21,F,Software Engineering,4,88,90,5
6,7,Usman,20,M,Information Technology,2,55,70,6
7,8,Hina,22,F,Computer Science,6,92,97,7
8,9,Bilal,24,M,Software Engineering,8,60,75,8
9,10,Zainab,19,F,Information Technology,1,83,89,9

In [41]:
dd.drop("Index", axis=1, inplace=True)
dd

,student_id,name,age,gender,department,semester,marks,attendance_percentage
0,1,Ali,20,M,Computer Science,2,85,92
1,2,Ayesha,21,F,Computer Science,4,78,88
2,3,Ahmed,22,M,Software Engineering,6,90,95
3,4,Fatima,19,F,Information Technology,2,65,80
4,5,Hamza,23,M,Computer Science,8,72,85
5,6,Sara,21,F,Software Engineering,4,88,90
6,7,Usman,20,M,Information Technology,2,55,70
7,8,Hina,22,F,Computer Science,6,92,97
8,9,Bilal,24,M,Software Engineering,8,60,75
9,10,Zainab,19,F,Information Technology,1,83,89

In [69]:
dd.loc[(dd["age"]>20) & (dd["gender"]=="M")]

,student_id,name,age,gender,department,semester,marks,attendance_percentage
2,3,Ahmed,22,M,Software Engineering,6,90,95
4,5,Hamza,23,M,Computer Science,8,72,85
8,9,Bilal,24,M,Software Engineering,8,60,75

In [70]:
students_data = {
    "student_id": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "name": ["Ali", "Ayesha", "Ahmed", "Fatima", "Hamza", "Sara", "Usman", "Hina", "Bilal", "Zainab"],
    "age": [20, 21, np.nan, 19, 23, 21, np.nan, 22, 24, 19],
    "gender": ["M", "F", "M", "F", "M", "F", "M", "F", "M", "F"],
    "department": [
        "Computer Science",
        "Computer Science",
        "Software Engineering",
        "Information Technology",
        "Computer Science",
        "Software Engineering",
        "Information Technology",
        "Computer Science",
        "Software Engineering",
        np.nan
    ],
    "semester": [2, 4, 6, 2, 8, 4, 2, 6, 8, 1],
    "marks": [85, np.nan, 90, 65, np.nan, 88, 55, 92, 60, 83],
    "attendance": [92, 88, 95, np.nan, 85, np.nan, 70, 97, np.nan, 89]
}
ds=pd.DataFrame(students_data)
ds

,student_id,name,age,gender,department,semester,marks,attendance
0,1,Ali,20.0,M,Computer Science,2,85.0,92.0
1,2,Ayesha,21.0,F,Computer Science,4,NaN,88.0
2,3,Ahmed,NaN,M,Software Engineering,6,90.0,95.0
3,4,Fatima,19.0,F,Information Technology,2,65.0,NaN
4,5,Hamza,23.0,M,Computer Science,8,NaN,85.0
5,6,Sara,21.0,F,Software Engineering,4,88.0,NaN
6,7,Usman,NaN,M,Information Technology,2,55.0,70.0
7,8,Hina,22.0,F,Computer Science,6,92.0,97.0
8,9,Bilal,24.0,M,Software Engineering,8,60.0,NaN
9,10,Zainab,19.0,F,NaN,1,83.0,89.0

In [84]:
ds.dropna(thresh=8)

,student_id,name,age,gender,department,semester,marks,attendance
0,1,Ali,20.0,M,Computer Science,2,85.0,92.0
7,8,Hina,22.0,F,Computer Science,6,92.0,97.0